In [1]:
import pandas as pd
import numpy as np
from datetime import date

In [13]:
client = pd.read_csv("ficheiros_competicao_tratados/client.csv", sep=",", na_values=["?"])

In [14]:
collected_date = pd.to_datetime("2000-01-01", format="%Y-%m-%d")

  client_id;"birth_number";"district_id"
0                          1;"706213";18
1                           2;"450204";1
2                           3;"406009";1
3                           4;"561201";5
4                           5;"605703";5

In [16]:
def getAge(row):
    date = pd.to_datetime(row['birth_date'], format='%Y-%m-%d')
    return collected_date.year - date.year - ((collected_date.month, collected_date.day) < (date.month, date.day))

In [17]:
client['age'] = client.apply(lambda x : getAge(x), axis=1)

In [18]:
client = client.drop(client.columns[[3]], axis=1)

In [19]:
client.head()

   client_id  district_id sex  age
0          1           18   f   29
1          2            1   m   54
2          3            1   f   59
3          4            5   m   43
4          5            5   f   39

In [20]:
demographics = pd.read_csv("demographics.csv", sep=",", header=0)
demographics = demographics.rename(columns={"code" : "district_id"})

client_demographics = pd.merge(client, demographics, on="district_id")

In [21]:
client_demographics.head()

,client_id,district_id,sex,age,no. of inhabitants,ratio of urban inhabitants,average salary,crime_increase,unemployment_increase,crime_avg,unemployment_avg
0,1,18,f,29,70699,65.3,8968,2.4,0.52,25.81,3.09
1,420,18,m,21,70699,65.3,8968,2.4,0.52,25.81,3.09
2,499,18,f,64,70699,65.3,8968,2.4,0.52,25.81,3.09
3,519,18,m,19,70699,65.3,8968,2.4,0.52,25.81,3.09
4,682,18,m,20,70699,65.3,8968,2.4,0.52,25.81,3.09

In [22]:
client_demographics = client_demographics.sort_values(by=['client_id'])

In [12]:
client_demographics.to_csv("client_demographics.csv", index=False, float_format="%.2f")